import React from 'react';
import Block from "./Block";

function WhyUs(props) {
    let card =
    (textEl) =>{ return  <div className="col-12 col-md-6 card-container ">
        <div className="card ">
            {textEl}
            <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">

                <rect x="0.5" y="0.5" width="34" height="34" stroke="#C6C6C6"/>
                <path
                    d="M27.4284 10.7342C27.1342 10.4395 26.6568 10.439 26.3626 10.733L17.3199 19.7518L14.0573 16.2083C13.7754 15.9023 13.2988 15.8825 12.9922 16.1643C12.6859 16.4462 12.6663 16.9231 12.9483 17.2294L16.7422 21.3498C16.8812 21.5008 17.0756 21.5885 17.2807 21.5927C17.2862 21.593 17.2915 21.593 17.2968 21.593C17.496 21.593 17.6877 21.5138 17.8289 21.3731L27.4269 11.8003C27.7219 11.5063 27.7224 11.0289 27.4284 10.7342Z"
                    fill="#C6C6C6"/>
                <path
                    d="M27.2462 17.2462C26.8299 17.2462 26.4925 17.5836 26.4925 18C26.4925 22.6829 22.6829 26.4925 18 26.4925C13.3173 26.4925 9.50754 22.6829 9.50754 18C9.50754 13.3173 13.3173 9.50754 18 9.50754C18.4163 9.50754 18.7538 9.17012 18.7538 8.75379C18.7538 8.33742 18.4163 8 18 8C12.4859 8 8 12.4859 8 18C8 23.5138 12.4859 28 18 28C23.5138 28 28 23.5138 28 18C28 17.5837 27.6626 17.2462 27.2462 17.2462Z"
                    fill="#C6C6C6"/>
            </svg>
        </div>
    </div>;}

    return (
        <Block className="why-us ">
            <h2 className="mb-5">ПОЧЕМУ ВЫБИРАЮТ НАС</h2>
            <div className="row g-3 mb-3">
                {card(<p>
                    Полностью <strong> персонализированный подход </strong>к оформлению
                    путешествия.
                </p>)}
                {card( <p>
                    <strong> Консьерж-сервис</strong> и дополнительные услуги по запросу
                    клиента: от билетов на мероприятия до уникальных туристических
                    маршрутов.
                </p>)}
            </div>
            <div className="row g-3 mb-3">
                {card( <p>
                    <strong>Эксклюзивные предложения</strong> от мировых отельных
                    цепочек.
                </p>)}
                {card(<p>
                    <strong>18 лет</strong> мы обеспечиваем незабываемый отдых клиентам
                    и поддерживаем безупречную репутацию.
                </p>)}
            </div>
            <div className="row g-3 mb-3">
                {card(<p>
                    <strong>Хорватия, Черногория, Словения и Италия</strong> – наши
                    основные направления. Мы досконально знаем эти страны.
                </p>)}
                {card(<p>
                    <strong>Требовательный подход и внимание к деталям</strong> мы
                    используем для организации туров и в другие страны.
                </p>)}
            </div>
            <div className="row g-3">
                {card(<p>
                    Гарантию лучшей стоимости мы обеспечиваем,{" "}
                    <strong>заранее выкупая авиабилеты на чартерные рейсы.</strong>
                </p>)}
                {card(<p>
                    <strong>С нами будут только приятные сюрпризы</strong>: мы вовремя
                    предоставим всю необходимую информацию по правилам въезда,
                    интересным событиям и другим важным новостям{" "}
                </p>)}
            </div>
        </Block>

    );
}

export default WhyUs;